"""
1. Червоний, зелений та синій кольори відомі як основні кольори
колірної моделі RGB. При змішуванні червоного та зеленого кольорів,
отримується жовтий, при змішуванні синього і зеленого - блакитний,
а при змішуванні синього і червоного – пурпуровий колір. Напишіть
програму, яка запропонує користувачеві ввести назви двох основних
кольорів для змішування. Якщо користувач вводить щось інше, ніж
«червоний», «синій» або «зелений», програма повинна виводити
повідомлення про відсутність такої палітри. В іншому випадку
програма повинна відображати назву кольору, що утворився.

Автор: Мовчан Микола
"""
first_color = input("Введіть перший колір (червоний, зелений, синій): ")
second_color = input("Введіть другий колір (червоний, зелений, синій): ")

if (first_color == "червоний" and second_color == "зелений") or (first_color == "зелений" and second_color == "червоний"):
    print("Змішаний колір: жовтий")
elif (first_color == "синій" and second_color == "зелений") or (first_color == "зелений" and second_color == "синій"):
    print("Змішаний колір: блакитний")
elif (first_color == "синій" and second_color == "червоний") or (first_color == "червоний" and second_color == "синій"):
    print("Змішаний колір: пурпуровий")
else:
    print(f"При змішуванні {first_color} та {second_color} кольорів, змішаний колір не знайдено в палітрі")